In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('abc.csv', sep=',', encoding='utf-8')

In [4]:
df

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [5]:
df_even = df[::2]

In [6]:
df_even

  student  language  science  maths  history
0   kumar        90       56     34       34
2   sammy        90       23     12       32
4   peter        30       56     45       65
6  carrol        50       90     45       23

In [7]:
# Even rows and first 3 columns

df_even_3 = df.iloc[::2, :3]

In [8]:
df_even_3

  student  language  science
0   kumar        90       56
2   sammy        90       23
4   peter        30       56
6  carrol        50       90